In [7]:
import pandas as pd
df = pd.read_csv('L1Data.csv', sep=',')
df.head()

      Class   Age  Funds Sale
0  Freshmen  18.0  600.0   No
1  Freshmen  18.0  500.0   No
2  Freshmen  18.0  600.0   No
3    Senior  23.0  800.0   No
4    Junior  21.0  400.0  Yes

In [9]:
age_mean = df['Age'].mean()
df['Age']= df['Age'].fillna(age_mean)
df['Age']

0     18.000000
1     18.000000
2     18.000000
3     23.000000
4     21.000000
5     19.000000
6     20.000000
7     24.000000
8     23.000000
9     25.000000
10    21.000000
11    21.000000
12    21.772727
13    21.000000
14    20.000000
15    21.000000
16    20.000000
17    26.000000
18    25.000000
19    41.000000
20    21.772727
21    18.000000
22    18.000000
23    18.000000
Name: Age, dtype: float64

In [11]:
def montyhall4(doors_chosen):
  if doors_chosen == 1:
    return "25%"
  elif doors_chosen == 2:
    return "33%"